export const VIBE_COLORS = {
    'летний': 'bg-orange-400 drop-shadow-[0_0_5px_rgba(251,146,60,0.8)]',
    'кислый': 'bg-lime-400 drop-shadow-[0_0_5px_rgba(163,230,53,0.8)]',
    'сладкий': 'bg-pink-400 drop-shadow-[0_0_5px_rgba(244,114,182,0.8)]',
    'выбор_команды': 'bg-sky-400 drop-shadow-[0_0_5px_rgba(56,189,248,0.8)]',
    'свежесть': 'bg-cyan-300 drop-shadow-[0_0_5px_rgba(103,232,249,0.8)]',
    'ягоды': 'bg-purple-500 drop-shadow-[0_0_5px_rgba(168,85,247,0.8)]',
    'лесные ягоды': 'bg-rose-500 drop-shadow-[0_0_5px_rgba(244,63,94,0.8)]',
    'десерты': 'bg-amber-700 drop-shadow-[0_0_5px_rgba(180,83,9,0.8)]',
    'фрукты': 'bg-yellow-400 drop-shadow-[0_0_5px_rgba(250,204,21,0.8)]',
    'напитки': 'bg-blue-500 drop-shadow-[0_0_5px_rgba(59,130,246,0.8)]',
    'тропики': 'bg-teal-400 drop-shadow-[0_0_5px_rgba(45,212,191,0.8)]',
    'необычный': 'bg-fuchsia-500 drop-shadow-[0_0_5px_rgba(217,70,239,0.8)]',
    'цветы': 'bg-rose-400 drop-shadow-[0_0_5px_rgba(251,113,133,0.8)]',
    'аренда': 'bg-emerald-400 drop-shadow-[0_0_5px_rgba(52,211,153,0.8)]',
    'премиум': 'bg-yellow-600 drop-shadow-[0_0_5px_rgba(202,138,4,0.8)]',
    'чайный': 'bg-amber-600 drop-shadow-[0_0_5px_rgba(217,119,6,0.8)]',
    'холод': 'bg-blue-300 drop-shadow-[0_0_5px_rgba(147,197,253,0.8)]'
};

export const VIBE_RGB_MAP = {
    'летний': '251, 146, 60',       // orange-400
    'кислый': '163, 230, 53',       // lime-400
    'сладкий': '244, 114, 182',     // pink-400
    'выбор_команды': '56, 189, 248',// sky-400
    'свежесть': '103, 232, 249',    // cyan-300
    'ягоды': '168, 85, 247',        // purple-500
    'лесные ягоды': '244, 63, 94',  // rose-500
    'десерты': '180, 83, 9',        // amber-700
    'фрукты': '250, 204, 21',       // yellow-400
    'напитки': '59, 130, 246',      // blue-500
    'тропики': '45, 212, 191',      // teal-400
    'необычный': '217, 70, 239',    // fuchsia-500
    'цветы': '251, 113, 133',       // rose-400
    'аренда': '52, 211, 153',       // emerald-400
    'премиум': '202, 138, 4',       // yellow-600
    'чайный': '217, 119, 6',        // amber-600
    'холод': '147, 197, 253'        // blue-300
};
